turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2016 Atmel Corporation,                                        -->
<!--                    a wholly owned subsidiary of Microchip Technology Inc.    -->
<!-- Licensed under the Apache License, Version 2.0 (the "License");              -->
<!-- you may not use this file except in compliance with the License.             -->
<!-- You may obtain a copy of the Licence at                                      -->
<!--                                                                              -->
<!--     http://www.apache.org/licenses/LICENSE-2.0                               -->
<!--                                                                              -->
<!-- Unless required by applicable law or agreed to in writing, software          -->
<!-- distributed under the License is distributed on an "AS IS" BASIS,            -->
<!-- WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.     -->
<!-- See the License for the specific language governing permissions and          -->
<!-- limitations under the License.                                               -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="SAM4LS4A-MU" package="QFN48" pinout="QFP48_noLCD" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="1.68" vccmax="3.6"/>
    <variant ordercode="SAM4LS4A-AU" package="TQFP48" pinout="QFP48_noLCD" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="1.68" vccmax="3.6"/>
  </variants>
  <devices>
    <device name="ATSAM4LS4A" architecture="CORTEX-M4" family="SAM4" series="SAM4L">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x40000" type="flash" pagesize="512" rw="RW" exec="true"/>
          <memory-segment name="USER_PAGE" start="0x00800000" size="0x200" type="user_page" pagesize="512" rw="RW"/>
          
          <memory-segment name="HRAMC0" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HRAMC1" start="0x21000000" size="0x800" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HTOP0" start="0x40000000" size="0xA0000" type="io" rw="RW"/>
          <memory-segment name="HTOP1" start="0x400A0000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HTOP2" start="0x400E0000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HTOP3" start="0x400F0000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/><memory-segment name="SYSTEM" start="0xE0000000" size="0x20000000" type="io"/></address-space>
        <address-space id="fuses" name="fuses" start="0x400A0014" size="8" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="__BB_PRESENT" value="0"/>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__CONST_AHB_CTRL" value="0"/>
        <param name="__DEBUG_LVL" value="3"/>
        <param name="__FPU_PRESENT" value="0"/>
        <param name="__JTAG_PRESENT" value="1"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__TRACE_LVL" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
        <param name="__WIC_LINES" value="3"/>
        <param name="__WIC_PRESENT" value="0"/>
      </parameters>
      <peripherals>
        <module name="ABDACB" id="I7563" version="1.0.0">
          <instance name="ABDACB">
            <register-group name="ABDACB" name-in-module="ABDACB" address-space="base" offset="0x40064000"/>
            <signals>
              <signal group="CLK" function="C" pad="PA31"/>
              <signal group="DAC" index="0" function="C" pad="PA27"/>
              <signal group="DAC" index="0" function="B" pad="PA17"/>
              <signal group="DAC" index="1" function="C" pad="PA29"/>
              <signal group="DAC" index="1" function="B" pad="PA19"/>
              <signal group="DACN" index="0" function="C" pad="PA28"/>
              <signal group="DACN" index="0" function="B" pad="PA18"/>
              <signal group="DACN" index="1" function="C" pad="PA30"/>
              <signal group="DACN" index="1" function="B" pad="PA20"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="6"/>
              <param name="PDCA_ID_TX_CH0" value="31"/>
              <param name="PDCA_ID_TX_CH1" value="32"/>
              <param name="INSTANCE_ID" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="ACIFC" id="I7564" version="1.0.1">
          <instance name="ACIFC">
            <register-group name="ACIFC" name-in-module="ACIFC" address-space="base" offset="0x40040000"/>
            <signals>
              <signal group="ACAN" index="0" function="E" pad="PA06"/>
              <signal group="ACAP" index="0" function="E" pad="PA07"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="14"/>
            </parameters>
          </instance>
        </module>
        <module name="ADCIFE" id="I7569" version="1.0.0">
          <instance name="ADCIFE">
            <register-group name="ADCIFE" name-in-module="ADCIFE" address-space="base" offset="0x40038000"/>
            <signals>
              <signal group="AD" index="0" function="A" pad="PA04"/>
              <signal group="AD" index="1" function="A" pad="PA05"/>
              <signal group="AD" index="2" function="A" pad="PA07"/>
              <signal group="ADVREFP" function="default" pad="ADVREFP_ADC"/>
              <signal group="TRIGGER" function="E" pad="PA05"/>
            </signals>
            <parameters>
              <param name="CHANNELS" value="16"/>
              <param name="CHANNEL_MSB" value="15"/>
              <param name="EXT_TRIGGERS_MSB" value="0"/>
              <param name="GCLK_NUM" value="10"/>
              <param name="PDCA_ID_RX" value="11"/>
              <param name="PDCA_ID_TX" value="29"/>
              <param name="INSTANCE_ID" value="12"/>
            </parameters>
          </instance>
        </module>
        <module name="AST" id="I7532" version="3.1.1">
          <instance name="AST">
            <register-group name="AST" name-in-module="AST" address-space="base" offset="0x400F0800"/>
            <parameters>
              <param name="CLK1K" value="4"/>
              <param name="CLK32" value="1"/>
              <param name="GCLK_NUM" value="2"/>
              <param name="GENCLK" value="3"/>
              <param name="PB" value="2"/>
              <param name="RCOSC" value="0"/>
              <param name="INSTANCE_ID" value="98"/>
            </parameters>
          </instance>
        </module>
