turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4A.atdf
        <module name="TRNG" id="I7643" version="1.0.3">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x40068000"/>
            <parameters>
              <param name="INSTANCE_ID" value="17"/>
            </parameters>
          </instance>
        </module>
        <module name="TWIM" id="I7535" version="1.2.0">
          <instance name="TWIM0">
            <register-group name="TWIM0" name-in-module="TWIM" address-space="base" offset="0x40018000"/>
            <parameters>
              <param name="PDCA_ID_RX" value="5"/>
              <param name="PDCA_ID_TX" value="23"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
          <instance name="TWIM1">
            <register-group name="TWIM1" name-in-module="TWIM" address-space="base" offset="0x4001C000"/>
            <parameters>
              <param name="PDCA_ID_RX" value="6"/>
              <param name="PDCA_ID_TX" value="24"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
          <instance name="TWIM2">
            <register-group name="TWIM2" name-in-module="TWIM" address-space="base" offset="0x40078000"/>
            <parameters>
              <param name="PDCA_ID_RX" value="7"/>
              <param name="PDCA_ID_TX" value="25"/>
              <param name="INSTANCE_ID" value="21"/>
            </parameters>
          </instance>
          <instance name="TWIM3">
            <register-group name="TWIM3" name-in-module="TWIM" address-space="base" offset="0x4007C000"/>
            <parameters>
              <param name="PDCA_ID_RX" value="8"/>
              <param name="PDCA_ID_TX" value="26"/>
              <param name="INSTANCE_ID" value="22"/>
            </parameters>
          </instance>
        </module>
        <module name="TWIMS" version="1.0.0">
          <instance name="TWIMS0">
            <signals>
              <signal group="TWCK" function="B" pad="PA24"/>
              <signal group="TWD" function="B" pad="PA23"/>
            </signals>
          </instance>
          <instance name="TWIMS1">
            <signals>
            </signals>
          </instance>
          <instance name="TWIMS2">
            <signals>
              <signal group="TWCK" function="E" pad="PA22"/>
              <signal group="TWD" function="E" pad="PA21"/>
            </signals>
          </instance>
          <instance name="TWIMS3">
            <signals>
            </signals>
          </instance>
        </module>
        <module name="TWIS" id="I7537" version="1.4.0">
          <instance name="TWIS0">
            <register-group name="TWIS0" name-in-module="TWIS" address-space="base" offset="0x40018400"/>
            <parameters>
              <param name="PDCA_ID_RX" value="9"/>
              <param name="PDCA_ID_TX" value="27"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
          <instance name="TWIS1">
            <register-group name="TWIS1" name-in-module="TWIS" address-space="base" offset="0x4001C400"/>
            <parameters>
              <param name="PDCA_ID_RX" value="10"/>
              <param name="PDCA_ID_TX" value="28"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="USART" id="I7601" version="6.0.2.1">
          <instance name="USART0">
            <register-group name="USART0" name-in-module="USART" address-space="base" offset="0x40024000"/>
            <signals>
              <signal group="CLK" function="B" pad="PA04"/>
              <signal group="CLK" function="A" pad="PA10"/>
              <signal group="CTS" function="A" pad="PA09"/>
              <signal group="RTS" function="B" pad="PA06"/>
              <signal group="RTS" function="A" pad="PA08"/>
              <signal group="RXD" function="B" pad="PA05"/>
              <signal group="RXD" function="A" pad="PA11"/>
              <signal group="TXD" function="B" pad="PA07"/>
              <signal group="TXD" function="A" pad="PA12"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
              <param name="PDCA_ID_RX" value="0"/>
              <param name="PDCA_ID_TX" value="18"/>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
          <instance name="USART1">
            <register-group name="USART1" name-in-module="USART" address-space="base" offset="0x40028000"/>
            <signals>
              <signal group="CLK" function="A" pad="PA14"/>
              <signal group="CTS" function="B" pad="PA21"/>
              <signal group="RTS" function="A" pad="PA13"/>
              <signal group="RXD" function="A" pad="PA15"/>
              <signal group="TXD" function="A" pad="PA16"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
              <param name="PDCA_ID_RX" value="1"/>
              <param name="PDCA_ID_TX" value="19"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
          <instance name="USART2">
            <register-group name="USART2" name-in-module="USART" address-space="base" offset="0x4002C000"/>
            <signals>
              <signal group="CLK" function="A" pad="PA18"/>
              <signal group="CTS" function="B" pad="PA22"/>
              <signal group="RTS" function="A" pad="PA17"/>
              <signal group="RXD" function="B" pad="PA25"/>
              <signal group="RXD" function="A" pad="PA19"/>
              <signal group="TXD" function="B" pad="PA26"/>
              <signal group="TXD" function="A" pad="PA20"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
              <param name="PDCA_ID_RX" value="2"/>
              <param name="PDCA_ID_TX" value="20"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
          <instance name="USART3">
            <register-group name="USART3" name-in-module="USART" address-space="base" offset="0x40030000"/>
            <signals>
              <signal group="CLK" function="E" pad="PA29"/>
              <signal group="CTS" function="E" pad="PA28"/>
              <signal group="RTS" function="E" pad="PA27"/>
              <signal group="RXD" function="E" pad="PA30"/>
              <signal group="TXD" function="E" pad="PA31"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
              <param name="PDCA_ID_RX" value="3"/>
              <param name="PDCA_ID_TX" value="21"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
