turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4A.atdf
        <register name="ODMERC" offset="0xE8" rw="W" size="4" access-size="4" atomic-op="clear:ODMER" caption="Open Drain Mode Register - Clear">
          <bitfield name="P0" caption="Open Drain Mode Enable" mask="0x1"/>
          <bitfield name="P1" caption="Open Drain Mode Enable" mask="0x2"/>
          <bitfield name="P2" caption="Open Drain Mode Enable" mask="0x4"/>
          <bitfield name="P3" caption="Open Drain Mode Enable" mask="0x8"/>
          <bitfield name="P4" caption="Open Drain Mode Enable" mask="0x10"/>
          <bitfield name="P5" caption="Open Drain Mode Enable" mask="0x20"/>
          <bitfield name="P6" caption="Open Drain Mode Enable" mask="0x40"/>
          <bitfield name="P7" caption="Open Drain Mode Enable" mask="0x80"/>
          <bitfield name="P8" caption="Open Drain Mode Enable" mask="0x100"/>
          <bitfield name="P9" caption="Open Drain Mode Enable" mask="0x200"/>
          <bitfield name="P10" caption="Open Drain Mode Enable" mask="0x400"/>
          <bitfield name="P11" caption="Open Drain Mode Enable" mask="0x800"/>
          <bitfield name="P12" caption="Open Drain Mode Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Open Drain Mode Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Open Drain Mode Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Open Drain Mode Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Open Drain Mode Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Open Drain Mode Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Open Drain Mode Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Open Drain Mode Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Open Drain Mode Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Open Drain Mode Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Open Drain Mode Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Open Drain Mode Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Open Drain Mode Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Open Drain Mode Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Open Drain Mode Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Open Drain Mode Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Open Drain Mode Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Open Drain Mode Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Open Drain Mode Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Open Drain Mode Enable" mask="0x80000000"/>
        </register>
        <register name="ODMERT" offset="0xEC" rw="W" size="4" access-size="4" atomic-op="toggle:ODMER" caption="Open Drain Mode Register - Toggle">
          <bitfield name="P0" caption="Open Drain Mode Enable" mask="0x1"/>
          <bitfield name="P1" caption="Open Drain Mode Enable" mask="0x2"/>
          <bitfield name="P2" caption="Open Drain Mode Enable" mask="0x4"/>
          <bitfield name="P3" caption="Open Drain Mode Enable" mask="0x8"/>
          <bitfield name="P4" caption="Open Drain Mode Enable" mask="0x10"/>
          <bitfield name="P5" caption="Open Drain Mode Enable" mask="0x20"/>
          <bitfield name="P6" caption="Open Drain Mode Enable" mask="0x40"/>
          <bitfield name="P7" caption="Open Drain Mode Enable" mask="0x80"/>
          <bitfield name="P8" caption="Open Drain Mode Enable" mask="0x100"/>
          <bitfield name="P9" caption="Open Drain Mode Enable" mask="0x200"/>
          <bitfield name="P10" caption="Open Drain Mode Enable" mask="0x400"/>
          <bitfield name="P11" caption="Open Drain Mode Enable" mask="0x800"/>
          <bitfield name="P12" caption="Open Drain Mode Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Open Drain Mode Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Open Drain Mode Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Open Drain Mode Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Open Drain Mode Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Open Drain Mode Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Open Drain Mode Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Open Drain Mode Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Open Drain Mode Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Open Drain Mode Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Open Drain Mode Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Open Drain Mode Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Open Drain Mode Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Open Drain Mode Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Open Drain Mode Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Open Drain Mode Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Open Drain Mode Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Open Drain Mode Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Open Drain Mode Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Open Drain Mode Enable" mask="0x80000000"/>
        </register>
        <register name="ODCR0" offset="0x100" rw="RW" size="4" access-size="4" caption="Output Driving Capability Register 0">
          <bitfield name="P0" caption="Output Driving Capability Register Bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Output Driving Capability Register Bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Output Driving Capability Register Bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Output Driving Capability Register Bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Output Driving Capability Register Bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Output Driving Capability Register Bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Output Driving Capability Register Bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Output Driving Capability Register Bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Output Driving Capability Register Bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Output Driving Capability Register Bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Output Driving Capability Register Bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Output Driving Capability Register Bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Output Driving Capability Register Bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driving Capability Register Bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driving Capability Register Bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driving Capability Register Bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driving Capability Register Bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driving Capability Register Bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driving Capability Register Bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driving Capability Register Bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driving Capability Register Bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driving Capability Register Bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driving Capability Register Bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driving Capability Register Bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driving Capability Register Bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driving Capability Register Bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driving Capability Register Bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driving Capability Register Bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driving Capability Register Bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driving Capability Register Bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driving Capability Register Bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driving Capability Register Bit 0" mask="0x80000000"/>
        </register>
        <register name="ODCR0S" offset="0x104" rw="RW" size="4" access-size="4" atomic-op="set:ODCR0" caption="Output Driving Capability Register 0 - Set">
          <bitfield name="P0" caption="Output Driving Capability Register Bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Output Driving Capability Register Bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Output Driving Capability Register Bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Output Driving Capability Register Bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Output Driving Capability Register Bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Output Driving Capability Register Bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Output Driving Capability Register Bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Output Driving Capability Register Bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Output Driving Capability Register Bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Output Driving Capability Register Bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Output Driving Capability Register Bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Output Driving Capability Register Bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Output Driving Capability Register Bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driving Capability Register Bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driving Capability Register Bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driving Capability Register Bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driving Capability Register Bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driving Capability Register Bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driving Capability Register Bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driving Capability Register Bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driving Capability Register Bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driving Capability Register Bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driving Capability Register Bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driving Capability Register Bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driving Capability Register Bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driving Capability Register Bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driving Capability Register Bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driving Capability Register Bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driving Capability Register Bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driving Capability Register Bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driving Capability Register Bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driving Capability Register Bit 0" mask="0x80000000"/>
        </register>
