turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4A.atdf
        <register name="OSRR0C" offset="0x138" rw="RW" size="4" access-size="4" atomic-op="clear:OSRR0" caption="Output Slew Rate Register 0 - Clear">
          <bitfield name="P0" caption="Output Slew Rate Control Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Slew Rate Control Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Slew Rate Control Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Slew Rate Control Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Slew Rate Control Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Slew Rate Control Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Slew Rate Control Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Slew Rate Control Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Slew Rate Control Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Slew Rate Control Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Slew Rate Control Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Slew Rate Control Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Slew Rate Control Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Slew Rate Control Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Slew Rate Control Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Slew Rate Control Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Slew Rate Control Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Slew Rate Control Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Slew Rate Control Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Slew Rate Control Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Slew Rate Control Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Slew Rate Control Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Slew Rate Control Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Slew Rate Control Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Slew Rate Control Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Slew Rate Control Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Slew Rate Control Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Slew Rate Control Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Slew Rate Control Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Slew Rate Control Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Slew Rate Control Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Slew Rate Control Enable" mask="0x80000000"/>
        </register>
        <register name="OSRR0T" offset="0x13C" rw="RW" size="4" access-size="4" atomic-op="toggle:OSRR0" caption="Output Slew Rate Register 0 - Toggle">
          <bitfield name="P0" caption="Output Slew Rate Control Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Slew Rate Control Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Slew Rate Control Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Slew Rate Control Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Slew Rate Control Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Slew Rate Control Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Slew Rate Control Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Slew Rate Control Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Slew Rate Control Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Slew Rate Control Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Slew Rate Control Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Slew Rate Control Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Slew Rate Control Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Slew Rate Control Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Slew Rate Control Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Slew Rate Control Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Slew Rate Control Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Slew Rate Control Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Slew Rate Control Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Slew Rate Control Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Slew Rate Control Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Slew Rate Control Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Slew Rate Control Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Slew Rate Control Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Slew Rate Control Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Slew Rate Control Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Slew Rate Control Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Slew Rate Control Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Slew Rate Control Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Slew Rate Control Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Slew Rate Control Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Slew Rate Control Enable" mask="0x80000000"/>
        </register>
        <register name="STER" offset="0x160" rw="RW" size="4" access-size="4" caption="Schmitt Trigger Enable Register">
          <bitfield name="P0" caption="Schmitt Trigger Enable" mask="0x1"/>
          <bitfield name="P1" caption="Schmitt Trigger Enable" mask="0x2"/>
          <bitfield name="P2" caption="Schmitt Trigger Enable" mask="0x4"/>
          <bitfield name="P3" caption="Schmitt Trigger Enable" mask="0x8"/>
          <bitfield name="P4" caption="Schmitt Trigger Enable" mask="0x10"/>
          <bitfield name="P5" caption="Schmitt Trigger Enable" mask="0x20"/>
          <bitfield name="P6" caption="Schmitt Trigger Enable" mask="0x40"/>
          <bitfield name="P7" caption="Schmitt Trigger Enable" mask="0x80"/>
          <bitfield name="P8" caption="Schmitt Trigger Enable" mask="0x100"/>
          <bitfield name="P9" caption="Schmitt Trigger Enable" mask="0x200"/>
          <bitfield name="P10" caption="Schmitt Trigger Enable" mask="0x400"/>
          <bitfield name="P11" caption="Schmitt Trigger Enable" mask="0x800"/>
          <bitfield name="P12" caption="Schmitt Trigger Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Schmitt Trigger Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Schmitt Trigger Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Schmitt Trigger Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Schmitt Trigger Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Schmitt Trigger Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Schmitt Trigger Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Schmitt Trigger Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Schmitt Trigger Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Schmitt Trigger Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Schmitt Trigger Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Schmitt Trigger Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Schmitt Trigger Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Schmitt Trigger Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Schmitt Trigger Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Schmitt Trigger Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Schmitt Trigger Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Schmitt Trigger Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Schmitt Trigger Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Schmitt Trigger Enable" mask="0x80000000"/>
        </register>
        <register name="STERS" offset="0x164" rw="RW" size="4" access-size="4" atomic-op="set:STER" caption="Schmitt Trigger Enable Register - Set">
          <bitfield name="P0" caption="Schmitt Trigger Enable" mask="0x1"/>
          <bitfield name="P1" caption="Schmitt Trigger Enable" mask="0x2"/>
          <bitfield name="P2" caption="Schmitt Trigger Enable" mask="0x4"/>
          <bitfield name="P3" caption="Schmitt Trigger Enable" mask="0x8"/>
          <bitfield name="P4" caption="Schmitt Trigger Enable" mask="0x10"/>
          <bitfield name="P5" caption="Schmitt Trigger Enable" mask="0x20"/>
          <bitfield name="P6" caption="Schmitt Trigger Enable" mask="0x40"/>
          <bitfield name="P7" caption="Schmitt Trigger Enable" mask="0x80"/>
          <bitfield name="P8" caption="Schmitt Trigger Enable" mask="0x100"/>
          <bitfield name="P9" caption="Schmitt Trigger Enable" mask="0x200"/>
          <bitfield name="P10" caption="Schmitt Trigger Enable" mask="0x400"/>
          <bitfield name="P11" caption="Schmitt Trigger Enable" mask="0x800"/>
          <bitfield name="P12" caption="Schmitt Trigger Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Schmitt Trigger Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Schmitt Trigger Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Schmitt Trigger Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Schmitt Trigger Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Schmitt Trigger Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Schmitt Trigger Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Schmitt Trigger Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Schmitt Trigger Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Schmitt Trigger Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Schmitt Trigger Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Schmitt Trigger Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Schmitt Trigger Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Schmitt Trigger Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Schmitt Trigger Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Schmitt Trigger Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Schmitt Trigger Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Schmitt Trigger Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Schmitt Trigger Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Schmitt Trigger Enable" mask="0x80000000"/>
        </register>
        <register name="STERC" offset="0x168" rw="RW" size="4" access-size="4" atomic-op="clear:STER" caption="Schmitt Trigger Enable Register - Clear">
          <bitfield name="P0" caption="Schmitt Trigger Enable" mask="0x1"/>
          <bitfield name="P1" caption="Schmitt Trigger Enable" mask="0x2"/>
          <bitfield name="P2" caption="Schmitt Trigger Enable" mask="0x4"/>
          <bitfield name="P3" caption="Schmitt Trigger Enable" mask="0x8"/>
          <bitfield name="P4" caption="Schmitt Trigger Enable" mask="0x10"/>
          <bitfield name="P5" caption="Schmitt Trigger Enable" mask="0x20"/>
          <bitfield name="P6" caption="Schmitt Trigger Enable" mask="0x40"/>
          <bitfield name="P7" caption="Schmitt Trigger Enable" mask="0x80"/>
          <bitfield name="P8" caption="Schmitt Trigger Enable" mask="0x100"/>
          <bitfield name="P9" caption="Schmitt Trigger Enable" mask="0x200"/>
          <bitfield name="P10" caption="Schmitt Trigger Enable" mask="0x400"/>
          <bitfield name="P11" caption="Schmitt Trigger Enable" mask="0x800"/>
          <bitfield name="P12" caption="Schmitt Trigger Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Schmitt Trigger Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Schmitt Trigger Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Schmitt Trigger Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Schmitt Trigger Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Schmitt Trigger Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Schmitt Trigger Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Schmitt Trigger Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Schmitt Trigger Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Schmitt Trigger Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Schmitt Trigger Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Schmitt Trigger Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Schmitt Trigger Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Schmitt Trigger Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Schmitt Trigger Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Schmitt Trigger Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Schmitt Trigger Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Schmitt Trigger Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Schmitt Trigger Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Schmitt Trigger Enable" mask="0x80000000"/>
        </register>
        <register name="STERT" offset="0x16C" rw="RW" size="4" access-size="4" atomic-op="toggle:STER" caption="Schmitt Trigger Enable Register - Toggle">
          <bitfield name="P0" caption="Schmitt Trigger Enable" mask="0x1"/>
          <bitfield name="P1" caption="Schmitt Trigger Enable" mask="0x2"/>
          <bitfield name="P2" caption="Schmitt Trigger Enable" mask="0x4"/>
          <bitfield name="P3" caption="Schmitt Trigger Enable" mask="0x8"/>
          <bitfield name="P4" caption="Schmitt Trigger Enable" mask="0x10"/>
          <bitfield name="P5" caption="Schmitt Trigger Enable" mask="0x20"/>
          <bitfield name="P6" caption="Schmitt Trigger Enable" mask="0x40"/>
          <bitfield name="P7" caption="Schmitt Trigger Enable" mask="0x80"/>
          <bitfield name="P8" caption="Schmitt Trigger Enable" mask="0x100"/>
          <bitfield name="P9" caption="Schmitt Trigger Enable" mask="0x200"/>
          <bitfield name="P10" caption="Schmitt Trigger Enable" mask="0x400"/>
          <bitfield name="P11" caption="Schmitt Trigger Enable" mask="0x800"/>
          <bitfield name="P12" caption="Schmitt Trigger Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Schmitt Trigger Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Schmitt Trigger Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Schmitt Trigger Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Schmitt Trigger Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Schmitt Trigger Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Schmitt Trigger Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Schmitt Trigger Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Schmitt Trigger Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Schmitt Trigger Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Schmitt Trigger Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Schmitt Trigger Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Schmitt Trigger Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Schmitt Trigger Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Schmitt Trigger Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Schmitt Trigger Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Schmitt Trigger Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Schmitt Trigger Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Schmitt Trigger Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Schmitt Trigger Enable" mask="0x80000000"/>
        </register>
        <register name="EVER" offset="0x180" rw="RW" size="4" access-size="4" caption="Event Enable Register">
          <bitfield name="P0" caption="Event Enable" mask="0x1"/>
          <bitfield name="P1" caption="Event Enable" mask="0x2"/>
          <bitfield name="P2" caption="Event Enable" mask="0x4"/>
          <bitfield name="P3" caption="Event Enable" mask="0x8"/>
          <bitfield name="P4" caption="Event Enable" mask="0x10"/>
          <bitfield name="P5" caption="Event Enable" mask="0x20"/>
          <bitfield name="P6" caption="Event Enable" mask="0x40"/>
          <bitfield name="P7" caption="Event Enable" mask="0x80"/>
          <bitfield name="P8" caption="Event Enable" mask="0x100"/>
          <bitfield name="P9" caption="Event Enable" mask="0x200"/>
          <bitfield name="P10" caption="Event Enable" mask="0x400"/>
          <bitfield name="P11" caption="Event Enable" mask="0x800"/>
          <bitfield name="P12" caption="Event Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Event Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Event Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Event Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Event Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Event Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Event Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Event Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Event Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Event Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Event Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Event Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Event Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Event Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Event Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Event Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Event Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Event Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Event Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Event Enable" mask="0x80000000"/>
        </register>
        <register name="EVERS" offset="0x184" rw="W" size="4" access-size="4" atomic-op="set:EVER" caption="Event Enable Register - Set">
          <bitfield name="P0" caption="Event Enable" mask="0x1"/>
          <bitfield name="P1" caption="Event Enable" mask="0x2"/>
          <bitfield name="P2" caption="Event Enable" mask="0x4"/>
          <bitfield name="P3" caption="Event Enable" mask="0x8"/>
          <bitfield name="P4" caption="Event Enable" mask="0x10"/>
          <bitfield name="P5" caption="Event Enable" mask="0x20"/>
          <bitfield name="P6" caption="Event Enable" mask="0x40"/>
          <bitfield name="P7" caption="Event Enable" mask="0x80"/>
          <bitfield name="P8" caption="Event Enable" mask="0x100"/>
          <bitfield name="P9" caption="Event Enable" mask="0x200"/>
          <bitfield name="P10" caption="Event Enable" mask="0x400"/>
          <bitfield name="P11" caption="Event Enable" mask="0x800"/>
          <bitfield name="P12" caption="Event Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Event Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Event Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Event Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Event Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Event Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Event Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Event Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Event Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Event Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Event Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Event Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Event Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Event Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Event Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Event Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Event Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Event Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Event Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Event Enable" mask="0x80000000"/>
        </register>
