turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4A.atdf
      <value-group name="SPI_SR__TXEMPTY">
        <value name="0" caption="As soon as data is written in TDR." value="0"/>
        <value name="1" caption="TDR and internal shifter are empty. If a transfer delay has been defined, TXEMPTY is set after the completion ofsuch delay." value="1"/>
      </value-group>
      <value-group name="SPI_IER__ENDRX">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__ENDTX">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__MODF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__NSSR">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__OVRES">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__RDRF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__RXBUFF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__TDRE">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__TXBUFE">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IER__TXEMPTY">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__ENDRX">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__ENDTX">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__MODF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__NSSR">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__OVRES">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__RDRF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__RXBUFF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__TDRE">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__TXBUFE">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IDR__TXEMPTY">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the corresponding interrupt." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__ENDRX">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__ENDTX">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__MODF">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__NSSR">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__OVRES">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__RDRF">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__RXBUFF">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
