turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4A.atdf
        <register name="UPSTA5CLR" offset="0x574" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA5" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA6CLR" offset="0x578" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA6" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA7CLR" offset="0x57C" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA7" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA0SET" offset="0x590" rw="W" size="4" access-size="4" atomic-op="set:UPSTA0" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA1SET" offset="0x594" rw="W" size="4" access-size="4" atomic-op="set:UPSTA1" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA2SET" offset="0x598" rw="W" size="4" access-size="4" atomic-op="set:UPSTA2" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA3SET" offset="0x59C" rw="W" size="4" access-size="4" atomic-op="set:UPSTA3" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA4SET" offset="0x5A0" rw="W" size="4" access-size="4" atomic-op="set:UPSTA4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
