turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4A.atdf
      <value-group name="USBC_UESTA0__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UESTA1__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UESTA2__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UESTA3__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UESTA4__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UESTA5__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UESTA6__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UESTA7__CTRLDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG0__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG0__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG0__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG0__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UPCFG1__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG1__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG1__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG1__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UPCFG2__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG2__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG2__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG2__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UPCFG3__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG3__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG3__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG3__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UPCFG4__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG4__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG4__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG4__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UPCFG5__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG5__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG5__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG5__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UPCFG6__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
